Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: My friend and I went to Texas together.
chr: ᎣᎩᎾᎵ ᎣᎩᎾᎵᎪᎯ ᏬᎩᏁᏙᎸ ᏅᏓᎩᎢ.

source: I am going to go and visit my friend.
chr: ᎣᎩᎾᎵᎢ ᏫᏓᏥᏩᏛᎯᏙᎵ.

source: I saw her with her boyfriend a while ago.
chr: ᎤᎾᎵᎪᏗ ᎤᎾᎵᎪᏒ ᏥᏥᎪᎥ ᎪᎯ.

source: Are you going to get a plaid shirt?
chr: ᎤᎾᎶᎢᏓᏍ ᎠᎿᏬ ᏘᏁᏏ?

source: His white shirt got bloody when his nose started bleeding.
chr: ᎩᎬᎭ ᏄᎵᏍᏔᏅ ᎤᏁᎦ ᎤᏄᏮ ᎩᎦ ᏚᏴᏍᏉᎳ.

source: His skin is just burned
chr: ᎤᎪᏅᎢᏊ ᎤᏁᎦᎸᎢ.

source: He was hiding in an ugly house.
chr: ᎤᏁᎩᎸᏗ ᎠᏓᏁᎸ ᎤᏗᏍᎦᏢᎢ.

source: Quit. You're being too mean.
chr: ᏞᏍᏗ. Ꮩ ᏣᏁᎫᏣ.

source: Watch yourself, they have a mean dog.
chr: ᏣᏓᎦᏎᏍᏕᏍᏗ, ᎩᏟᏍ ᎤᏁᎫᏥᏓ ᎤᏁᎧᎭ.

source: I forgot to bring a blanket.
chr: ᎤᏁᎬᎭ ᏂᏛᎩᎾᏫᏘᏗ ᎠᏋᎨᏫᏒᎢ.

source: I always have milk to sell.
chr: ᏂᎪᎯᎸ ᎤᏅᏗ ᎠᎩᎾᏗᏅᏗ ᎠᎩᏁᎰᎢ.

source: The Bible says God's name is Jehovah.
chr: ᏱᎰᏩ ᏚᏙᎠ ᎤᏁᏝᏅᎯ ᎠᏗᎭ ᎦᎸᏉᏗ ᎪᏪᎵ.

source: He went to town after some ice.
chr: ᎤᏁᏍᏓᎳ ᎤᏯᎷᎦ ᏗᎦᏚᎲᎢ.

source: The snow stayed on the ground for a long time.
chr: ᎪᎯᏓ ᎠᎲ ᎦᏙᎯ ᎤᏅᏥ.

source: Did he know that you were supposed to come today?
chr: ᎤᏅᏖᎢᏍ ᎪᎯ ᎢᎦ ᏣᎷᎯᏍᏗ ᎨᏒ?

source: His grandfather raised him.
chr: ᎤᏂᏏ ᎤᏛᎯᏍᏔᏅᎢ.

source: He's shearing the sheep with shears.
chr: ᏗᎵᏍᏙᏱᏗ ᎬᏗ ᏓᏍᏙᏰ ᎤᏂᏃᏕᎾ.

source: A bell rings when it's time for church to start.
chr: ᎤᎭᎸᏂ ᎤᏃᏴᎪ ᎤᏓᎴᏅᏗ ᏱᎩ ᏓᏂᎳᏫᎬᎢ.

source: A tornado went through a big city.
chr: ᎤᏃᎴ ᎤᎯᎸᏍᏔᏅ ᎤᏔᎾ ᎦᏚᎲᎢ.

source: The month of January is the beginning of a new year.
chr: ᎤᏃᎸᏔᎾ ᎧᎸ ᎠᏓᎴᏂᏍᎬ ᎢᏤ ᎠᏕᏘᏱᏍᎬᎢ.

source: He likes to drink milk.
chr: ᎤᏅᏗ ᎤᎸᏉᏗ ᎤᏗᏔᏍᏗᎢ.

source: How big is the human brain?
chr: ᎯᎳ ᏂᎧ ᏴᏫ ᎤᏅᏥᏓ?

source: He has on thin covers.
chr: ᏧᏌᎨ ᏗᎿᎣᏬᏍᏙᏗ ᏚᎿᏬᏍᏗ.

source: She's ironing all of her dresses.
chr: ᏂᎦᏓ ᏧᏌᏃ ᏓᏖᏍᎦ.

source: When he entered the cave, they didn't see him a second time.
chr: ᎤᏍᏓᎦᎸ ᏭᏴᏝ, Ꮭ ᏔᎵᏁ ᏱᎤᏂᎪᎮᎢ.

source: Are there any crackers?
chr: ᏓᎭᏍ ᎦᏚ ᎤᏂᏍᏓᎦᏴᎯᏓ?

source: He cooked for his wife on her birthday.
chr: ᎤᏍᏓᏴᎲᏍᎩ ᎤᏕᏘᏱᏍᎬ ᎤᏍᏓᏴᏅᎢ.

source: I hear a little baby crying.
chr: ᎤᏍᏗ ᎠᏠᏱᎲ ᎦᏛᎩᎠ.

source: I like small cars better than big ones.
chr: ᏧᏍᏗ ᏓᏆᎴᎳ ᎤᎪᏗ ᏓᎩᎸᏉᏗ ᏏᏅ ᏧᏔᎾ ᎨᏒᎢ.

source: He got lost walking through a trail.
chr: ᎤᏍᏗ ᎦᏅᏅ ᎠᎢᏒ ᎤᎴᎾᏢᎢ.

source: He's scratching his scalp.
chr: ᎤᏍᏗᏁᎦᎸ ᎠᏜᎪᏍᎦ.

source: What is he being punished for?
chr: ᎦᏙ ᎤᏛᏁᎸ ᎤᏍᏛᏗᎠ?

source: He barely lifed the heavy rock.
chr: ᏎᎦᏨ ᎤᏌᎳᏓᏅ ᎦᎨᏓ ᏅᏯ.

source: Some people are slow to get ready. Today seemed to go by slow.
chr: ᎢᎦᏓ ᎤᏂᏍᎦᏃᎵ ᎨᏐ ᎤᎾᏛᏅᎢᏍᏙᏗᎢ. ᎤᏍᎦᏃᎵ ᎦᎶᎯ ᏂᎬᏩᏍᏗ ᎪᎯ ᎢᎦ.

source: The car has bright lights.
chr: Ꮎ ᏓᏆᎴᎳ ᏧᏍᎪᏍᏗ ᏚᏨᏍᏔ.

source: They talk about interesting things when they talk.
chr: ᎤᏍᏆᏂᎩᏗ ᎠᏂᏃᎮᎸᏍᎪ ᏳᏂᏬᏂᏌ.

source: He's rubbing his stomach.
chr: ᎤᏍᏉᏟ ᎠᏍᎪᎵᏰᎠ.

source: Hand me an empty can.
chr: ᎤᏏᏩ ᏔᎷᎩᏍᎩ ᎡᏍᎬᏏ.

source: He's coughing because he smokes too much.
chr: ᏥᏈᏗ ᎪᎦᏍᎬ ᎢᏳᏍᏗ ᎤᏏᏩᏍᎦ.

source: He found a human skull while digging.
chr: ᏴᏫ ᎤᏍᎧ ᎤᏩᏛᎲ ᎠᏍᎪᏍᎬᎢ.

source: The squirrel climbed to the top of the tree when the dog chased it.
chr: ᏡᎬ ᎤᏍᎪᎵ ᏭᎶᏢ ᏌᎶᎵ ᎩᏟ ᎤᎨᎮᎾ.

source: He didn't even see me standing behind him.
chr: Ꮭ ᏍᏊ ᏯᎩᎪᎮ ᎤᏐᏛ ᏥᏥᏙᎬᎢ.

source: Her hair is always clean.
chr: ᏂᎪᎯᎸ ᎤᏓᏅᎦᎸᏓ ᎨᏐ ᎤᏍᏘᎬᎢ.

source: The cat's claws are sharp.
chr: Ꮎ ᏪᏌ ᏚᏑᎦᏢ ᏗᎪᏍᏓᏱ.

source: Didn't he know he was wearing his pants inside out?
chr: ᏝᏍ ᏳᏅᏖ ᎦᏁᎦᏔᏴᏓ ᎤᏑᎸᎢ?

source: I wonder where he buys his pants?
chr: ᎭᏢᏍᎩᏂ ᏚᏩᏍᎪ ᏧᏑᎶ?

source: He's cleaning his shotgun.
chr: ᎤᏒᏕᎾ ᎤᏤᎵ ᎦᏅᎦᎵᎭ.

source: The water pipes froze last night.
chr: ᎠᎹ ᏧᏪᏓᏍᏗ ᏧᏒᏙᏂ ᏚᏁᏍᏓᎳᏛ ᎤᏒ ᏥᎨᏒᎢ.

source: When are you going to bed?
chr: ᎯᎳ ᎢᏴ ᏓᏨᏒᏟ?

source: My friend works during nights.
chr: ᎣᎩᎾᎵᎢ ᎤᏒ ᏚᎸᏫᏍᏓᏁᎰᎢ.

source: I am thirsty for water.
chr: ᎠᎹ ᎠᎩᏔᏕᎩᎠ

source: When he was called names, he becameenraged.
chr: ᎪᎱᏍᏗ ᎠᎪᏎᎸᏁᎳ, ᎤᏔᏝᏬᏒᎢ.

source: He is building a big house.
chr: ᎤᏔᎾ ᎦᎵᏦᏕ ᎠᏁᏍᎨᎭ.

source: This shirt is too big.
chr: ᎤᏔ Ꮒ ᎯᎠ Ꭰ ᎿᏬ.

source: He got burned by steam.
chr: ᎤᏔᏃᎸᏓ ᏚᎴᏴᏔᏅᎢ.

source: They're eating leftovers from yesterday.
chr: ᏒᎯ ᎤᏘᏴᏅᎢ ᎠᏂᎩᎠ.

source: He broke his ankle when he jumped from a tree.
chr: ᎤᏥᏆᎸᏛ ᎤᎵᏍᏆᎵᏎᎸ ᏡᎬ ᏙᏧᎵᏔᏗᎾ.

source: I don't like a crooked arrow.
chr: Ꮭ ᏯᎩᎸᏉᏗ ᎤᏥᏈᏗ ᎦᏟᏓ.

source: It rained a lot yesterday.
chr: ᎤᏥᏈᏍᏗ ᎤᎦᎿᏅ ᏒᎯ ᏥᎨᏒᎢ.

source: I hope to hear from her.
chr: ᎤᏚᎩ ᎠᏋᎭ ᏥᏯᏛᎪᏗᎢ.

source: I like to listen to thunder.
chr: ᎠᏴᏓᏆᎶᏍᎬ ᎠᏆᏛᏓᏍᏙᏗ ᎠᎩᎸᏉᏗ.

source: Who is the old chap?
chr: ᎦᎪ Ꮎ ᎤᏛᎯᏍᏗ?

source: When a man becomes fully grown, they call him an old man.
chr: ᎠᏍᎦᏯ ᏳᏛᏐᎿ, ᎤᏛᏐᏅ ᎠᏃᏎᎰᎢ.

source: Someone is hiding behind the bushes.
chr: ᏚᏩᎢᏢ ᎤᏟ ᏗᏜ ᎤᏗᏍᎦᏝ ᎩᎶᎢ.

source: What do you use to take fish scales off?
chr: ᎦᏙ ᎤᏍᏗ ᎲᏗᏍᎪ ᏅᏅᏕᏍᎩ ᎠᏣᏗ ᎤᏩᏥᏍᎦᏢᎢ?

source: Just forget about it.
chr: ᏫᏨᎨᏩᏊ.

source: Whenever he eats a lot, he belches.
chr: ᏥᏈᏍᏗ ᏳᎵᏓᏴᎿ, ᎤᏩᎫᎴᎪᎢ.

source: She's shivering because she's cold.
chr: ᎧᎾᏬᎬ ᎢᏳᏍᏗ, ᎤᎠᎾᏫᎠ.

source: Do you have any ripe cantaloupes?
chr: ᎠᏂᏩᏒᎩᏍ ᎤᏅᏂᏒ ᏕᏣᎭ?

source: She's wearing a sweater made from wool.
chr: ᎤᏩᏂ ᎪᏢᏔᏅ ᎠᎿᏩ ᎤᏄᏩ.

source: Owls like to sit on limbs.
chr: ᏚᏩᏂᎦᏢ ᎤᎾᎩᎸᏗ ᎤᏂᎸᏉᏗ ᏩᎱᎯ.

source: Why are you in such a hurry?
chr: ᎦᏙ ᏂᎦ ᏨᏅᎦ?

source: He came by himself. Only he knows what happened
chr: ᎤᏩᏌ ᎤᎷᏨᎢ. ᎤᏩᏌ ᎤᏅᏔ ᏄᎵᏍᏔᏂᏙᎸᎢ.

source: His hands became numb when they became cold.
chr: ᏧᏩᏒᎯ ᏂᏚᎵᏍᏔᏅ ᏧᏬᏰᏂ ᏚᏴᏜᏕᎳ.

source: He says he smells something strong.
chr: ᎪᎱᏍᏗ ᎤᏴᏍᏗ ᎤᏩᏩᏍᎦ ᎠᏗᎭ.

source: I have a shotgun.
chr: ᎦᎶᏇ ᎤᏒᏕᎾ ᎠᏋᏯ.

source: When he applauds, his hand hurts.
chr: ᏱᏚᏏᏛᎯᎳ, ᎤᏪᏲᏂ ᎤᏪᎯᏍᏓᏁᎰᎢ.

source: Wolves howled all night last night.
chr: ᎤᎵᏨᏓᏆᏓ ᎤᏁᏡᏅ ᏩᏯ ᎤᏒ ᏥᎨᏒᎢ.

source: How did he become wealthy?
chr: ᎦᏙ ᎠᏛᏁᎲ ᎤᏪᎿᎢ ᏄᎵᏍᏔᏁᎢ?

source: How much are a dozen eggs?
chr: ᎯᎳ ᏧᎬᏩᎵᏗ ᏌᏊ ᎢᎠᎳᏚ ᏧᏪᏥ?

source: He's going to go visit his sons.
chr: ᏧᏪᏥ ᎠᏂᏧᏣ ᏓᏩᏛᎮᎦ.

source: He's looking for his son.
chr: ᎤᏪᏥ ᎠᏧᏣ ᎠᏯᎭ.

source: The mother and her daughter look alike.
chr: Ꮎ ᎤᏓᏥ ᎤᏪᏥᏅᎠᎨᏯ ᎤᏂᏠᏱ ᏗᎨᎦᎦᏅᏗᎢ

source: His daughter is graduating this summer.
chr: ᎤᏪᏥ ᎠᎨᏳᏣ ᏓᏍᏆᏗᎠ ᎪᎯ ᎪᎩ.

source: Who did his son marry?
chr: ᎦᎪ ᎤᏯᏅᎮ ᎤᏪᏥ ᎠᏍᎦᏯ?

source: He has a mean dog.
chr: ᎩᏟ ᎤᎿᎸᎯ ᎤᏪᎧᎭ.

source: She's cooking liver.
chr: ᎤᏪᎳ ᎬᏂᏍᏗᎭ.

source: Don't worry.
chr: ᏞᏍᏗ ᏱᏤᎵᎯᏍᎨᏍᏗ.

source: He felt worried when he heard that his father was sick.
chr: ᎤᏪᎵᎯᏍᏗ ᎤᏓᏅᏓᏛᎢ ᎤᏛᎦᎾ ᎤᏙᏓ ᎤᏢᎬᎢ.

source: He has an old heating stove.
chr: ᎤᏪᏘ ᎣᏏ ᎠᎦᎾᏬᎯᏍᏗ ᎤᎭ.

source: I couldn't cross the river because it was too swift.
chr: ᎠᎩᏄᎸᏅ ᏗᎩᏐᎯᏍᏗ ᎤᏪᏴᎢ ᏍᏓᏱ ᎦᏃᎱᎩᏍᎬ ᎢᏳᏍᏗ.

source: She hung the damp clothes on the line.
chr: ᎠᏏᎳᏛ ᏚᎸᏅ ᏧᏬᏕᏫᏓ ᏗᎿᏬ.

source: There goes a brown car.
chr: ᎤᏬᏗᎨ ᏓᏆᎴᎳ ᎾᏟ.

source: She was given a pretty car when she graduated.
chr: ᎤᏬᏚᎯ ᏓᏆᎴᎳ ᎠᏥᏁᎸ ᏚᏍᏆᏓ.

source: He want's to play with foam.
chr: ᎤᏬᎩᏟ ᏧᏁᎶᏙᏗ ᎤᏚᎵᎭ.

source: He's always confident that he's doing the right thing. Have faith.
chr: ᎤᏬᎯᏳᏐ ᏚᏳᎪᏛ ᎾᏛᏁᎲᎢ. ᏦᎯᏳᏎᏍᏗ.

source: 1. Where will you be sitting? 2. Is your brother home?
chr: 1. ᎭᏢ ᎢᏴ ᏦᏞᏍᏗ? 2. ᎤᏬᏝᏍ ᏗᏍᏓᏓᏅᏟ?

source: He dived from a bluff.
chr: ᎤᏬᏝᎥᎢ ᏓᎤᏕᏘᏅᎢ.

source: The old man is telling funny stories.
chr: ᎤᏬᎵᏗ ᎧᏃᎮᏢᏍᎦ ᎤᏛᏐᏅᎢ.

source: My ankle is swollen.
chr: ᎤᏬᏘᏓ ᎠᎩᏥᏆᎸᏛᎢ.

source: He greeted him with his hand.
chr: ᎤᏬᏰᏂ ᎬᏗ ᎤᏲᎵᎸᎢ.

source: I see something furry.
chr: ᎪᎱᏍᏗ ᎤᏭᏯᏘ ᏥᎪᏩᏘᎭ.

source: He wants to talk with you for some reason.
chr: ᎪᎱᏍᏗ ᎤᏰᎸᏗ ᏍᏓᏟᏃᎡᏗ ᎤᏚᎵᎭ.

source: He stopped the car suddenly.
chr: ᎤᏰᎶᎢᏍᏗ ᎤᎴᏫᏍᏙᏔᏅ ᏓᏆᎴᎳ.

source: He swam naked in the creek.
chr: ᎤᏰᎸᎭ ᎤᏙᏬᎥ ᎤᏪᏴᎢ.

source: Why are you laughing?
chr: ᎦᏙ ᏥᏣᏰᏘᏍᎦ?

source: I'm itching where something bit me.
chr: ᎪᏍᏗ ᎠᎩᏍᎦᎵᏨ ᎠᎩᏲᏕᎠ.

source: He lost his watch underwater.
chr: ᎠᎹᏱ ᎭᏫᎾ ᎤᏲᎱᏎᎸ ᏩᏥ.

source: Why are some people afraid of dead people?
chr: ᎦᏙ ᎢᎦᏓ ᏧᏂᏲᎱᏒ ᏥᏓᏂᏍᎦᎰ?

source: His bicycle broke down on a bad road.
chr: ᎤᏲ ᎦᏅᏅ ᎤᏲᏤᎸ ᏔᎵ ᏗᎦᏆᏘ.

source: He's picking up a broken glass. She has a very spoiled child.
chr: ᎤᎸᏌᏗ ᎤᏲᏨ ᎫᏖᎠ. ᎤᏙᎯᏳ ᎤᏲᏨ ᎠᏲᏟ ᎤᏪᎧᎭ.

source: I didn't eat this morning and now I'm hungry.
chr: Ꮭ ᏯᏆᎵᏍᏓᏴᏁ ᏑᎾᎴ, ᏃᏊᏅ ᎠᎩᏲᏏᎭ.

source: Let's go fishing at the pond.
chr: ᎥᏓᎵ ᎢᎾᏑᏄᎦ.

source: He caught a bad disease.
chr: ᎤᏍᎦᏎᏗ ᎥᏳᎩ ᎤᏂᏴᎲᎢ.

source: Some say that locusts are good to eat
chr: ᎥᎴ ᎠᏃᏍᏓ ᏗᎦᏰᏍᏗ ᎠᎾᏗᏍᎪ ᎢᎦᏓ.

source: The house cost too much; therefore I didn't buy it.
chr: ᏥᏈᏍᏗ ᎤᎬᏩᎶᏗ ᎨᏒ ᎦᎵᏦᏕ; ᎥᏍᎩᏅ ᎢᏳᏍᏗ Ꮭ ᏯᎩᏩᏎᎢ.

source: Christmas is in the month of December.
chr: ᎥᏍᎩᏱ ᎧᎸ ᎨᏐ ᏗᏂᏍᏓᏲᎯᎲᎢ.

source: What would happen if they did that?
chr: ᎦᏙ ᏱᎦᎵᏍᏓ ᎥᏍᎩᎾ ᏱᏄᎾᏛᏁᎳ?

source: Dragonflies fly around close to a pond
chr: ᎥᏓᎵ ᎾᎥ ᎠᏂᏃᎯᎵᏙᎰ ᏩᏓᏚᎦ.

source: Where do you want me to send this box?
chr: ᎭᏢ ᏩᎩᏏᏍᏗ ᏣᏚᎵ ᎯᎠ ᎧᏁᏌᎢ?

source: Bees make honey.
chr: ᏩᏚᎵᏏ ᎠᏃᏢᏍᎪ ᏩᏚᎵᏏ.

source: He cut a blood vessel when he cut himself on the foot with an axe.
chr: ᏩᏚᎾ ᎤᎦᎵᏍᏔᏅ ᎤᎳᏏᏕᏂ ᎤᏓᎷᏯ.

source: This man owns a lot of cows.
chr: ᎯᎠ ᎠᏍᎦᏯ ᏥᏈᏍᏗ ᏩᎦ ᏚᎾᏝᎠ.

source: I like to eat beef.
chr: ᏩᎦ ᎭᏫᏯ ᎠᎩᎸᏉᏗ ᎠᎩᎩᏍᏗ

source: I know a girl whose last name is Owl.
chr: ᏩᎱᎯ ᏭᏍᏕᎵᏗ ᎠᎨᏳᏣ ᏥᏲᎵᎩ.

source: He sent the Christmas gift on December the 24th.
chr: ᎥᏍᎩᏱ ᏔᎵᏍᎪ ᏅᎩᏁ ᏭᏅ ᏓᏂᏍᏓᏲᎯᎲ ᎠᏓᏁᏗ.

source: Wolves are dangerous when they're hungry.
chr: ᏩᏯ ᏱᏚᏂᏲᏏ ᎠᏂᎾᏰᎪᎢ.

source: What time does the clock say?
chr: ᎯᎳ ᎠᏟᎢᎵ ᎠᏗᎭ ᏩᏥ?

source: If you swallow saliva while running, it tires you out.
chr: ᏩᏥᎳ ᏴᎩᏍᎦ ᎥᏟᏒ, ᏙᏯᏪᎢᏍᏗᏍᎪᎢ.

source: I'm heading for town.
chr: ᏗᎦᏚᎲ ᏫᏥᎦᏘ.

source: Hummingbirds cannot walk.
chr: ᏩᎴᎠ Ꮭ ᎠᏁᏙᎯ ᏱᎩ

source: The frogs are croaking.
chr: ᏩᎶᏏ ᎾᏂᏪᎠ.

source: He's chopping on a hickory tree.
chr: ᏩᏁᎢ ᏡᎬᎢ ᎦᎷᏯᏍᎪ.

source: She likes to use a soft pillow.
chr: ᏩᏂᎨ ᎠᏆᏍᏙ ᎤᏮᏙᏗ ᎤᎸᏉᏗ.

source: She thought it was a moth, but it was a butterfly.
chr: ᏩᏐᏝ ᎤᏪᎵᏒ ᎠᏎᏅ ᎧᎹᎹ ᎨᏒᎢ.

source: Do you know anyone named Washington?
chr: ᎯᏲᎵᎩᏍ ᎩᎶ ᏩᏒᏓᎾ ᎤᏙᎢᏓ?

source: Have you been to Washington?
chr: ᏤᏙᎸᎢᏍ ᏩᏒᏓᏃᎢ?

source: Did you see a cat?
chr: ᏪᏌᏍ ᎯᎪᏩᏘ?

source: Whenever she goes somewhere, she takes her child to her neighbor.
chr: Ꮲ ᏰᎦ, ᎾᎥ ᎢᏧᎾᏓᎵ ᏗᎦᏁᎸ ᏫᎦᎧᎲᏍᎪᎢ ᎤᏪᏥ ᎠᏲᏟ.

source: She took the glass of water inside.
chr: ᎦᎵᏦᏕ ᏭᏁᏅ ᎠᎹ ᎠᏟᏍᏛ ᎤᎸᏌᏗ.

source: When his son asked him for some money, he sent him a twenty dollar bill.
chr: ᎠᏕᎳ ᏧᏔᏲᏎᎳ ᎤᏪᏥ ᏔᎵᏍᎪ ᎠᏕᎸ ᏭᏅᏁᎸᎢ.

source: Some pigeons are message carriers.
chr: ᎧᏃᎮᏓ ᎠᏂᎯᏙᎯ ᎢᎦᏓ ᏬᏱ.

source: The sun goes out of sight in the west.
chr: ᏭᏕᎵᎦ ᎢᏗᏜ ᏭᏕᎵᎪ ᎢᎦ ᎡᎯ ᏅᏓ.

source: Clouds are forming in the west.
chr: ᏭᏕᎵᎬ ᎢᏗᏜ ᏗᎦᎶᎩᎳᏗᎠ.

source: What do you want me to do with the rest of the money?
chr: ᎦᏙ ᏗᏋᏁᏗ ᏣᏚᎵ ᏭᏅᎦᏗ ᎠᏕᎳ?

source: The buffalo is almost extinct.
chr: ᏯᏂᏌ ᎤᎾᏨᏂᏗ.

source: He goes wherever he wants to go anytime.
chr: ᏱᏂᎦᎵᏍᏗᎭᏊ ᎢᎸᏢ ᎤᏪᏅᏍᏗ ᏳᏚᎵ ᎡᎪ ᏱᏂᎦᎵᏍᏗᎭᏊ ᎢᏴᎢ?

source: You may choose anyone to help you.
chr: ᏱᏂᎦᎵᏍᏗᎭᏊ ᎩᎶ ᎯᏯᏑᏰᏍᏗ ᏣᏍᏕᎵᏍᎩ.

source: Have you seen anyone wrestle a bear?
chr: ᎯᎪᎥᎢᏍ ᎩᎶ ᏲᎾ ᎠᏁᏍᏗᏍᎬᎢ?

source: That white man is speaking English.
chr: Ꮎ ᎠᏲᏁᎦ ᏲᏁᎦ ᎦᏬᏂᎭ.

source: Sometimes things don't turn out the way I want them to.
chr: ᏳᏓᎭ Ꮭ ᎠᏆᏚᎵᏍᎬ ᏱᏂᎦᎵᏍᏗᏍᎪ.

source: He broke his hammer driving a nail.
chr: ᎦᏅᏆᎶᏍᏗ ᎤᏲᏤᎸ ᏴᎩ ᎦᎭᏛᏍᎬᎢ.

source: Long ago Cherokees used to tell stories about cannibals.
chr: ᎪᎯᎩᏴ ᏥᎨᏒ ᎠᏂᏴᏩᎩᏍᎩ ᏓᏂᏃᏁᏍᎬ ᎠᏂᏣᎳᎩ.
